Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དོན་ཡོད་ཞགས་པའི་གཟུགས་བརྙན་གྱི། །མདུན་དུ་ལྕི་བའི་དཀྱིལ་འཁོར་བགྱི། །གྲུ་བཞི་ཁོ་ར་ཁོར་ཡུག་ཏུ།
en: Using cow dung, he should build a complete four-sided maṇḍala in front of an image of Amoghapāśa.

source: །ཚོན་རྩི་དཀར་པོ་ཞིབ་མོ་ཡིས། །གྲུ་བཞི་ལྷམ་པར་ཐིག་གདབ་བོ། །ངོས་བཞི་རྣམས་སུ་སྒོ་བཞི་དག །དབུས་ནས་ངོས་བཞིར་གཤིས་སུ་དབབ།
en: Using powdered conch and gold, he should trace the shapes of the four corners and the four doors and, in the center, another quadrangle with four sides.

source: །ཙནྡན་དཀར་པོས་བྲི་བ་ནི། །དཀྱིལ་འཁོར་མཆོག་ལ་པདྨ་དང་། །འདབ་བརྒྱ་གུར་གུམ་གྱིས་གཏོར་ཞིང་།
en: He should then draw the supreme maṇḍala, a hundred-petaled lotus, out of white sandalwood and scatter saffron on it.

source: །པདྨའི་ཟེ་བའི་དཀྱིལ་དག་ཏུ། །མ་ཞོམ་པ་ཡི་བུམ་པ་ནི། །སྤོས་ཆབ་ཀྱིས་ནི་བཀང་བ་ཡི། །ཡུངས་ཀར་ལྡན་པ་གཞག་པར་བགྱི།
en: In the middle of the lotus’ pericarp he should place a pitcher filled with scented water and mustard seeds.

source: །ཨ་ག་རུ་ཡི་བདུག་པ་དབུལ། །བུམ་པ་གང་བར་དགོད་པར་བགྱི། །མེ་ཏོག་སྣ་ཚོགས་བརྒྱན་པར་བགྱི། །མཆོད་ཡོན་སྣོད་ཀྱང་བཞི་གཞག་གོ།
en: Burning incense of agarwood, he should place full jars around the maṇḍala, decorate them with various flowers, and place four bowls with the welcome offering of water. “

source: །རིག་སྔགས་འཆང་བ་གཙང་གྱུར་པས། །གཙང་མའི་གོས་ནི་བགོ་བར་བགྱི། །ལེགས་བཀྲུས་རྣམ་པར་དག་པ་དང་། །གསོ་སྦྱོང་དག་ནི་བླངས་པ་དང་།
en: The vidyā holder should make himself ritually pure, wear clean clothes, and observe the ritual fast.

source: །དཀར་གསུམ་ཟས་ནི་འཚལ་ནས་སུ། །དུས་གསུམ་དུ་ནི་ཁྲུས་བགྱིའོ། །དུས་གསུམ་བཟླས་བརྗོད་བགྱི་བ་ནི། །དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དག །
en: He should live on the three ‘white’ foods and perform three ablutions at the three junctions of the day.

source: དུས་གསུམ་དུ་ཡང་བརྒྱ་རྩ་བརྒྱད།
en: He should recite the heart mantra of Amoghapāśa one hundred and eight times at the three junctions of the day.

source: །འཕགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་གི། །མངོན་སུམ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ། །བཟླས་བརྗོད་ཕྱག་རྒྱ་བཅིངས་ནས་སུ། །བགྲང་ཕྲེང་དག་ནི་བླང་བར་བགྱི། །མཛུབ་མོ་དག་ནི་མཐེ་བོ་དག །
en: Seated in a cross-legged position before Noble Avalokiteśvara, he should display the mudrā of recitation while holding a rosary of beads with the index and the middle finger extended.

source: བརྐྱང་ནས་ཞི་ཞིང་དུལ་བ་ཡི། །ཡིད་ཀྱིས་བྱམས་སེམས་མཉམ་པར་གཞག །
en: Calm and collected, he should focus his mind on compassion.

source: ཏིང་འཛིན་བརྟག་པས་ལུས་སྙོམས་པར། །ལེགས་པར་བཞག་སྟེ་ཞི་བར་ལྟ། །ཚིག་གཞན་མི་སྨྲ་བཟླས་བརྗོད་བགྱི།
en: In a state of meditation, with a balanced body and tranquil gaze, he should recite while refraining from speaking any other words. “

source: །བཟླས་བརྗོད་བགྱིས་པ་ཙམ་གྱི་མོད་ལ། ས་ཆེན་པོ་གཡོ་བར་འགྱུར་རོ།
en: The moment he begins his recitation, the ground will quake violently.

source: །དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ། ཕྱག་རྒྱ་བཅིངས་ནས་ས་ཆེན་པོ་ཡང་གཡོ་བར་འགྱུར་རོ།
en: He should form the mudrā of Amoghapāśa and bow in greeting, after which there will be a great earthquake.

source: །བརྟན་པའི་སེམས་ཀྱིས་སྐྲག་པར་མི་བགྱིའོ།
en: He must not be afraid but, with a steady mind, wholly focus on compassion for all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་ཞགས་པའི་ཞབས་མཐོང་བ་ཙམ་དུ་བྲིས་ལ།
en: He should fix his gaze on the feet of Noble Avalokiteśvara-Amoghapāśa and recite the Krodharāja mantra seven times.

source: ཅི་ཙམ་ན་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་སོ། །ལན་བདུན་བཟླས་པ་ཙམ་གྱི་མོད་ལ་ས་ཆེན་པོ་གཡོ་ཞིང་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: As soon as seven recitations are completed, there will be a violent shaking and roaring.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དཔྲལ་བ་ནས་འོད་ཟེར་བྱུང་ནས་ཀུན་ཏུ་སྣང་བར་འགྱུར་རོ།
en: Rays of light will issue from the forehead of Noble Avalokiteśvara and shine everywhere. “

source: །རིག་སྔགས་འཆང་དེ་ཡང་ཆེར་སྙིང་དགའ་བ་དང་། བཞིན་འཛུམ་པ་དང་།
en: The vidyā holder, his heart filled with tremendous joy, will smile.

source: ཤིན་ཏུ་རབ་ཏུ་དགའ་བས་སྤུ་ཟིང་ཞེས་བགྱིད་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གདོང་དུ་བལྟ་བར་བགྱི་སྟེ།
en: With goose bumps from rapturous delight, he will look up at the face of the Lord.

source: གདོང་དུ་བལྟས་པ་ཙམ་གྱི་མོད་ལ། བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ངོས་གཡས་པ་ནས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: As soon as he looks up, the right face of the noble lord Avalokiteśvara will say ‘Good!’

source: །མིག་སྒྱུར་བར་བགྱིད་ཅིང་ཀུན་ཏུ་ལེགས་སོ་ཞེས་བགྱི་བའི་སྒྲ་བྱུང་ན།
en: as he looks around. As soon as the word ‘good!’

source: རིག་སྔགས་འཆང་གིས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པ་ཐོབ་ནས་ལུས་ཡོངས་སུ་དག་པ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: is heard, all the vidyā holder’s obscurations will be purified, and his body will be replete with great purity.

source: །དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ས་ཡ་ཕྲག་བརྒྱ་སྟོང་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བལྟ་བའི་འོས་སུ་འགྱུར་རོ།
en: He will accumulate roots of virtue equal to that of hundreds of thousands of millions of billions of tathāgatas, and all bodhisattvas will be willing to see him.

source: །ལུས་འཇམ་པ་དང་ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པ་དང་མཉེན་པར་འགྱུར་རོ། །སྐྲ་ཅུང་ཟད་འཁྱིལ་པ་དང་མཉེན་པ་དང་། སྙན་པའི་ཚིག་སྨྲ་བར་འགྱུར་རོ།
en: His body will be soft, supple, and tender, his hair will become curly, and his speech will be pleasant and sweet.

source: །མིག་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་རོ། །ལུས་ཡོངས་སུ་དག་པ་དང་། ཡིད་ཡོངས་སུ་དག་པ་དང་།
en: His vision will be purified, as will his body and mind.

source: གཉེར་མ་དང་། སྐྲ་སྐྱ་བོ་སྤངས་པར་འགྱུར་རོ།
en: His grey hair will disappear.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བ་དག་པ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་རོ། །ཅི་ཙམ་དུ་འདུག་ཅེ་ན།
en: He will also attain the samādhi called the pure perception of all beings.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་སྟོན་ཅིང་དབུགས་འབྱིན་པར་བགྱིད་དོ།
en: Before dawn, Noble Avalokiteśvara will appear in person and give him comfort. “

source: །ལག་པ་གཡས་པ་སྤྱི་བོར་བཞག་ནས་མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ། །ནམ་མཁའ་ལ་མཆི་བའམ། མི་གདའ་བར་བགྱི་བའམ། ལྷའི་མིག་འཐོབ་པའམ། སངས་རྒྱས་ཀྱི་ཞིང་ལ་བལྟ་བའམ། ཏིང་ངེ་འཛིན་རབ་ཏུ་འཐོབ་པའམ། གཟུངས་རབ་ཏུ་འཐོབ་པའམ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོ་འགྲུབ་པའམ།
en: He will place his right hand on the vidyā holder’s head and grant him every boon, including the ability to travel through space, become invisible, possess the divine eye, see buddha fields, attain samādhi, attain dhāraṇī, and find success in the rites connected to the essence of Amoghapāśa.

source: གཙུག་ལག་སྨྲ་བའམ། གསང་སྔགས་སྨྲ་བའམ། ཐོས་པ་འཛིན་པ་ཉིད་དམ། གཏེར་སྨྲ་བའམ། ནོར་སྒྱུར་བ་སྨྲ་བའམ། མིག་འཕྲུལ་
en: He will also be granted the ability to explain scientific treatises and mantras, to remember what he has heard, and to explain the location of treasure or mineral deposits.

source: སྨྲ་བའམ། འཇིག་རྟེན་དུ་འགྲོ་བའམ། ཕུག་ཏུ་འཇུག་པའམ། ཀླུའི་གནས་སུ་འཇུག་པའམ། ཞིང་སྨྲ་བའམ། གནོད་སྦྱིན་དགུག་པའམ། སྲིན་པོ་དགུག་པའམ། རོ་ལངས་བསླང་བའམ། ནགས་ཁྲོད་དུ་འཇུག་པའམ། རི་ལ་རྒྱུ་བའམ། གྲོང་ཁྱེར་དུ་འཇུག་པའམ། སྨན་བལྟ་བའི་ཕྱིར་འཇུག་པའམ།
en: He will gain the ability to work magic, visit divine realms, enter terrestrial passages and the abodes of nāgas, describe any realm, summon yakṣas or rākṣasas, raise vetālas, enter inaccessible forests or mountains, enter cities, and identify and use medicinal herbs.

source: རལ་གྲི་རིག་སྔགས་འཆང་ཉིད་དམ། གྲུབ་པའི་རིག་སྔགས་འཆང་ཉིད་དམ། འཁོར་ལོས་སྒྱུར་བ་ཉིད་དམ། རྒྱལ་བོ་འཐོབ་པའམ། ཡུལ་འཐོབ་པའམ།
en: He will be able to become a sword vidyādhara, a siddha vidyādhara, or a wheel-turning monarch and to obtain a kingdom, a country, or the position of the governor of a country.

source: ཡུལ་གྱི་བདག་པོ་ཉིད་དམ། དཔུང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པའམ། བསྐྲད་པའམ། རྒྱ་མཚོར་འཇུག་པ་དེ་དག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: He will be able to crush great armies, work as spy, or dive deep into the ocean.

source: །དགོས་པ་གྲུབ་པ་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara will grant all of this and will help him accomplish every task.

source: །ཅི་ལྟར་གང་དུ་འཚལ་བར་ཡོངས་སུ་སྐྱོང་བར་འགྱུར་རོ། །མཚམས་མ་མཆིས་པ་ལྔ་རྣམས་འབྱུང་བར་འགྱུར་རོ།
en: He will protect the vidyā holder wherever and in whatever way is required, and he will purify the five acts of immediate retribution.

source: །རྟག་ཏུ་བཟླས་བརྗོད་བགྱིས་ན། སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བ་སྒྲིབ་པ་དང་བྲལ་བ་དག་པ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder recites the mantra continuously, he will attain the samādhi called removing impediments to seeing all beings. “

source: །མིག་སྨན་སྒྲུབ་པར་འཚལ་བས། དེས་ཟླ་བ་ཡར་གྱི་ངོ་ཚེས་བརྒྱད་ལ་ལྡོང་རོས་ཀྱི་མིག་སྨན་ཟངས་ཀྱི་སྣོད་ཀྱི་ནང་དུ་སྩལ་ཏེ། ཙནྡན་གྱི་དཀྱིལ་འཁོར་བགྱིས་ལ།
en: If the vidyā holder wants to accomplish the magical eye ointment, he should place some realgar paste in a copper vessel on the eighth day of the bright fortnight, trace a maṇḍala with sandalwood powder in front of Noble Avalokiteśvara, and place the vessel there.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་བཞག་ནས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ་གོས་གཙང་མ་བགོས་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་ན་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས་བཟླས་བརྗོད་བགྱིའོ།
en: Bathed and wearing clean clothes, he should sit in a cross-legged position facing Noble Avalokiteśvara and recite the mantra.

source: །དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱའི་མཚམས་བཅིང་བས་མཚམས་བཅིང་བར་བགྱིའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་དུ་བཟླས་པར་བགྱིའོ།
en: He should create a protective boundary by bringing to mind the Krodharāja mantra seven times while displaying the mudrā of Amoghapāśa.

source: །ཟས་དཀར་གསུམ་འཚལ་བར་བགྱིའོ།
en: He should live on the three ‘white’ foods.

source: །རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་གང་ཡང་རུང་བས། འཕགས་པའི་ཡན་ལག་བརྒྱད་ཀྱི་བསྙེན་གནས་ལ་གོམས་པར་བགྱིས་ནས་བཟླས་བརྗོད་བགྱིའོ།
en: Vidyā holders—sons or daughters of the Buddha’s family—should observe the eight limbs of the one-day fast before engaging in mantra recitation. “

source: །བཟླས་བརྗོད་བགྱིས་པ་ཙམ་གྱི་མོད་ལ།
en: As soon as the vidyā holder has completed the recitation, the paste in the vessel will begin to blaze and emit smoke and foam.

source: ཟངས་ཀྱི་སྣོད་འབར་བ་དང་།
en: Once it has heated up and foamed, he should take it and anoint his eyes with it.

source: རླངས་པ་དང་། དབུ་བ་འབྱུང་བར་འགྱུར་ཏེ། དེ་བླངས་ནས་མིག་ལ་བྱུགས་ན་ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་མཆིས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་མཐོང་བ་དང་།
en: He will magically ascend into the sky and will see all the buddha fields and all the tathāgatas and buddhas in the ten directions.

source: རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོར་འགྱུར་རོ།
en: He will become a great emperor of the vidyādharas.

source: །ཕུག་གི་གནས་ཕྱེ་བ་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ། །གཏེར་བྱུང་བ་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ།
en: He will see all underground passages and dwellings open wide, and he will see all treasures rise to the surface.

source: །ལྷའི་གནས་ཐམས་ཅད་ཀྱི་སྒོ་ཕྱེ་བ་མཐོང་བར་འགྱུར་རོ། །གང་དུ་འཚལ་བ་དེར་མཆི་བར་འགྱུར་རོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་།
en: He will watch as the gates to all the palaces in the god realms open, and he will be able to enter whichever one he wants.

source: གདོན་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། ཕས་ཀྱི་རྒོལ་བ་དང་། མི་མཛའ་བ་ཐམས་ཅད་མི་གདའ་བར་འགྱུར་རོ།
en: He will be invisible to all yakṣas, rākṣasas, bhūtas, piśācas, grahas, and other nonhuman and human beings, as well as to his opponents and adversaries. “

source: །ཚེས་བརྒྱད་དམ། བཅུ་བཞིའམ། བཅྭ་ལྔ་ལ་ཚིག་གཞན་མི་སྨྲ་བར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས། ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ།
en: On the eighth, fourteenth, and fifteenth days of the lunar fortnight, he should recite the mantra one thousand and eight times without speaking any other words and while seated in a cross-legged position in front of Noble Avalokiteśvara.

source: །བཟླས་བརྗོད་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལྷའི་བདག་ཉིད་ཀྱི་རང་གི་གཟུགས་ཀྱིས་མདུན་དུ་མཆིས་ནས། ལག་པ་གཡས་པ་སྤྱི་བོར་བཞག་པ་དང་།
en: As soon as he completes the recitation, Noble Avalokiteśvara will appear before the vidyā holder in person in his divine form and place his right hand on the vidyā holder’s head.

source: དྲི་མེད་འཕགས་ཀྱི་ལྟ་བའི་ཆོ་འཕྲུལ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་འཐོབ་ཅིང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གཟིགས་པའི་བྱིན་གྱིས་བརླབས་བཀོད་པ་ཡང་དག་པར་ལྟ་བ་སྣང་བ་ཞེས་བྱ་བའི་རྫུ་འཕྲུལ་ཐོབ་ནས།
en: The vidyā holder will then attain the samādhi called the wondrous display of the immaculately arising gaze and will obtain the magical power called the splendorous display magically created by the gaze of all the tathāgatas.

source: ཚེའི་ཚད་ལྷའི་བསྐལ་པ་སྟོང་དུ་འགྱུར་རོ།
en: His lifespan will be extended to one thousand divine eons. “

source: །བདག་ཉིད་ལྷའི་རང་བཞིན་ཐོབ་པ་དང་།
en: Having obtained a divine form, the vidyā holder will be able to see all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱིས་དམ་པའི་ཆོས་ཀྱི་གཏམ་གླེང་བར་མཛད་པ་ཐོས་པར་འགྱུར་རོ།
en: The Tathāgata Amitāyus, the worthy, fully realized Buddha, will induct him into the true Dharma.

source: །བདེ་བ་ཅན་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་བསུ་བའི་སླད་དུ།
en: All the bodhisattva great beings who dwell in the realm of Sukhāvatī will approach him and attend upon him.

source: ལྷའི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་པར་འགྱུར་རོ། །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་ཡང་འགྱུར་རོ། །པདྨ་སྣང་བའི་གཞལ་མེད་ཁང་ཞེས་བགྱི་བའི་ཁང་པ་བརྩེགས་མའི་གཞལ་མེད་ཁང་ཐོབ་པར་འགྱུར་རོ།
en: He will obtain a divine form, his hair will become wavy and curly, and he will acquire a palatial residence called The Resplendence and Purity of a Lotus. “

source: །དེ་ནས་རང་གི་ལུས་རྡོ་རྗེ་སྲ་བ་བདག་ཉིད་ཀྱི་སྙིང་པོའི་རང་བཞིན་ཐོབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་སྤོས་ཆབ་དེས་བུམ་པ་བཀང་ནས་ལན་དྲུག་ཁྲི་ཉིས་སྟོང་བཟླས་བརྗོད་བགྱིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་ཉིན་ཞག་གཅིག་མཆིས་པར་འགྱུར་བས་ཁྲུས་བགྱིའོ།
en: If the vidyā holder wants to have a body with a diamond core, he should fill a pitcher with scented water and incant it with the mantra sixty-two thousand times in front of the image of the noble bodhisattva Avalokiteśvara while fasting for one day and one night.

source: །ཁྲུས་བགྱིས་པ་ཙམ་གྱི་མོད་ལ།
en: He should then perform ablutions with the water from the pitcher.

source: ལུས་རྡོ་རྗེ་ལས་བྱུང་བའི་རང་བཞིན་དུ་འགྱུར་རོ།
en: As soon as he does, his body will be as if made from diamond.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དེ་ལ་གཟིགས་པར་འགྱུར་རོ། །ཚེ་ལྷའི་ལོ་ཁྲིར་འགྱུར་རོ།
en: All the tathāgatas will look upon him, and his lifespan will increase to one thousand divine years.

source: །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གདོན་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: All yakṣas, rākṣasas, bhūtas, and grahas will fall under his thrall.

source: །ལྷ་དང་། ཀླུ་ཐམས་ཅད་ཀྱི་དཔོན་པོར་འགྱུར་རོ། །འཇིག་རྟེན་པའི་དགོས་པ་སྒྲུབ་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: All gods and nāgas will manifest and perform all his worldly duties. “

source: །དྲན་པ་ཙམ་མམ་སེམས་བསྐྱེད་པ་ཙམ་གྱི་མོད་ལ་གདོན་ཐམས་ཅད་དང་། བརྗེད་བྱེད་ཐམས་ཅད་བབས་ནས་ཐམས་ཅད་སྨྲ་བར་འགྱུར་ཏེ། བདེན་པའམ་མི་བདེན་པའམ་ཡང་དག་པའམ། ཡང་དག་པ་མ་ལགས་པའམ། སྐལ་བ་དང་ལྡན་པའམ་སྐལ་བ་དང་མི་ལྡན་པའམ། བྱུང་བའམ། མ་བྱུང་བའམ།
en: As soon as the vidyā holder recalls something or has a particular idea, all the grahas and apasmāras will come and tell him everything there is to know: whether something is true or untrue, real or unreal, or proper or improper, whether it has happened or not, whether it can be increased by magic, or whether it will bring comfort and prosperity—they will tell him all of this.

source: འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དེ་ཐམས་ཅད་སྨྲ་བར་འགྱུར་རོ། །དེ་ལ་སོགས་ཏེ་ལས་བགྱི་བ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: They will perform all these and other necessary duties.

source: །དྲན་བཞིན་དུ་ལས་ཐམས་ཅད་རྟག་ཏུ་བགྱིད་པར་འགྱུར་རོ། །ཡང་ན་འཇིག་རྟེན་ཐམས་ཅད་སོ་སོར་བསྒྲལ་བར་འཚལ་བའམ། ཐམས་ཅད་དབང་དུ་གྱུར་ནས་གཞག་པར་འཚལ་ལམ།
en: Like servants, they are ready to perform any task. “

source: ཐམས་ཅད་སེམས་ཅན་དམྱལ་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ལས་ཐར་བར་བགྱི་བར་འཚལ་ལམ། དོན་ཡོད་ཡེ་ཤེས་བཀོད་པ་ཞེས་བགྱི་པའི་ཏིང་ངེ་འཛིན་འཐོབ་པར་འཚལ་ལམ། རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་བསྒྲུབ་པར་འཚལ་ལམ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོ་བསྒྲུབ་པར་འཚལ་ན།
en: Now, if the vidyā holder wants to ascend through all the worlds, one by one, and bring all of them under his control; if he wants to liberate all hell beings, animals, and the inhabitants of the realm of Yama; if he wants to attain the samādhi called the magical display of the amogha wisdom; if he wants to accomplish the maṇḍala of liberation; or if he wants to successfully perform the rites of the essence of Amoghapāśa or the great rites of the essence of Amoghapāśa, he should make individual images of Noble Avalokiteśvara in his form of Amoghapāśa. “

source: རིག་སྔགས་འཆང་དེས་གཟུགས་བརྙན་སོ་སོ་བ་བཞིན་དུ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་གཟུགས་སུ་བགྱིས་ཏེ། རལ་པའི་ཐོར་ཚུགས་དང་རི་དགས་ཨེ་ན་ཡའི་པགས་པས་བརྒྱན་པ། ཕྱུགས་བདག་གི་ཆ་ལུགས་འཆང་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: The figure should be adorned with a topknot and a diadem and should wear a garment made from the skin of a black antelope as worn by Paśupati and all ornamentation.

source: སྐྱིལ་མོ་ཀྲུང་ངམ་འགྲེང་བ་དང་དྲུང་ན་ནོར་བཟངས་པུས་མོ་གཡས་པ་ཕབ་པ།
en: The figure should be sitting either in a cross-legged posture or in the manner of the bodhisattva Sudhana, with his right knee raised and his left on the ground.

source: གཡོན་པ་ཁྲོ་བོའི་རྒྱལ་པོ་གདོང་གྱེན་དུ་ལྟ་བ་ཁྲོ་བོའི་གཟུགས་ལག་པ་དྲུག་པ།
en: It should have the face of Krodharāja, with an upward gaze and the six arms characteristic of his wrathful form.

source: འོད་དཔག་མེད་ཀྱི་དབུ་རྒྱན་ཐོགས་པ།
en: Amitābha should be at the top of its diadem, and it should be adorned with all types of ornaments.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་པ་ཐམས་ཅད་རིང་བསྲེལ་དང་བཅས་པར་བགྱི་སྟེ།
en: All the figures should have relics inside them.

source: རིའི་སྟེང་གི་པདྨའི་སྟན་ལ་མཆིས་པར་བགྱིའོ།
en: They should be placed on a lotus seat on top of a mountain. “

source: །གཙང་མས་གོས་གཙང་མ་བགོས་ཏེ། དུས་གསུམ་དུ་ཁྲུས་བགྱིས་ན་ཉིན་ཞག་གཅིག་མཆིས་ཏེ།
en: Ritually pure and wearing clean clothes, the vidyā holder should fast for one day and one night, without even drinking.

source: རིག་སྔགས་འཆང་གིས་བའི་རྣམ་ལྔས་ཉེ་རེག་བགྱིའོ། །ཆབ་དང་ཡུངས་ཀར་གྱི་དབང་བསྐུར་བས། དབང་བསྐུར་བར་བགྱིའོ། །སྙིང་རྗེ་ཆེན་པོས་གདུངས་པའི་སྙིང་གིས་བལྟ་བར་བགྱིའོ།
en: He should sip the five products of the cow, consecrate himself by sprinkling himself with water and mustard seeds, and gaze out with a heart overflowing with compassion.

source: །གལ་ཏེ་འདི་ལྟ་བུའི་ཆོ་གས་མི་བགྱིད་ན། བཀླགས་པ་ཙམ་གྱི་མོད་ལ་ཡང་འགྲུབ་པར་འགྱུར་ན། བཟླས་བརྗོད་ཀྱི་ལས་ཀྱི་ཆོ་གས་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: Because the ritual will succeed even if it is only read and not properly performed, why speak of what will happen if the recitation and ritual actions are complete? “

source: ཡང་རིག་སྔགས་འཆང་གང་ཞིག་གང་གཱའི་ཀླུང་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བརྒྱད་ཀྱི་བྱེ་མ་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་མཆོད་པར་འཚལ་ལམ། བལྟ་བར་འཚལ་ལམ། དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོ་བསྐྱེད་པར་འཚལ་ལམ། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་རྩ་བ་ལ་རབ་ཏུ་གཞག་པར་འཚལ་བའམ། ཐམས་ཅད་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་བགྱི་བར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་དགེ་སློང་ཕའམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ཕའམ། དགེ་བསྙེན་མའམ། རྒྱལ་པོའམ། བཙུན་མོའམ། གཞན་སུ་ཡང་རུང་བས་ཐམས་ཅད་ཆོ་ག་འདི་བཞིན་བགྱིས་ཏེ།
en: Vidyā holders—be they a monk or nun, male or female lay practitioner, king or queen—who wants to see and worship the tathāgatas, the worthy, fully realized buddhas, who are equal in number to the eighty-eight million grains of sand in the Gaṅgā river; who want to plant many roots of virtue for themself and for all beings; and who want to purify all evil should follow this procedure: “The vidyā holder should make, according to his means, a golden figure of Noble Avalokiteśvara-Amoghapāśa and install it facing east.

source: དེས་ཅི་འབྱོར་པའི་གསེར་ལས་དོན་ཡོད་པའི་ཞགས་པའི་གཟུགས་བརྙན་བགྱིའོ། །དེ་ནས་ཁ་ཤར་ཕྱོགས་སུ་བསྟན་ཏེ་གཞག་ལ་གུར་གུམ་གྱི་དཀྱིལ་འཁོར་བགྱི་སྟེ། གྲུ་བཞི་ཆ་འབྱེས་པར་ལི་ཁྲིས་ཐིག་གདབ་པར་བགྱིའོ།
en: Using saffron, he should draw a four-sided maṇḍala that is well measured and outlined with vermillion.

source: །དཀྱིལ་འཁོར་དབུས་སུ་པདྨའི་ཕྲེང་བ་བགྱིའོ། །པདྨའི་ཕྲེང་བའི་དབུས་སུ་རིལ་བ་སྤྱི་བླུགས་དང་བགྲང་ཕྲེང་གཞག་པར་བགྱིའོ།
en: In the center of the maṇḍala, he should draw a garland of lotuses, in the center of which should be placed a pitcher of water and a rosary.

source: །མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བགྱིའོ། །སྤོས་ཆབ་ཀྱིས་བཀང་བའི་བུམ་པ་མེ་ཏོག་ཅི་འབྱོར་པས་ལེགས་པར་བརྒྱན་པ་བཞི་གཞག་པར་བགྱིའོ།
en: He should adorn it with various flowers and place around it four jars that are filled with scented water and decorated with flowers to the extent his means allow.

source: །མཆོད་ཡོན་གྱི་སྣོད་ལྔ་གཞག་པར་བགྱིའོ། །པོག་ཕོར་གྱི་སྣོད་ལྔ་ནས་ཨ་ག་རུའི་བདུག་པས་བདུག་པར་བགྱིའོ། །དྲིས་བསྒོས་པའི་མར་མེ་བཅུ་དྲུག་སྦར་བར་བགྱིའོ།
en: He should add five bowls of offering water, burn agarwood incense in five incense holders, and light sixteen lamps filled with scented oil.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པར་བགྱིའོ། །མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བའང་དབུལ་བར་བགྱིའོ།
en: He should worship Noble Avalokiteśvara with offerings of flowers, incense, fragrances, and garlands. “

source: །འཇིག་རྟེན་དབང་ཕྱུག་གི་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཙས་ཏེ་མཆིས་ནས་དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ།
en: Facing the Lokeśvara, the vidyā holder should sit in a cross-legged position, display the mudrā of Amoghapāśa, and consecrate himself by bringing the mantra of Krodharāja to mind one time.

source: བདག་ཉིད་ལ་དབང་བསྐུར་བར་བགྱིའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཅིག་བཟླས་བརྗོད་བགྱིའོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་དམིགས་པ་ཡིད་ལ་བགྱིས་ནས། ཕྱོགས་བཅུར་ཡིད་ཀྱིས་མཆོད་ཅིང་ཕྱག་བགྱིའོ།
en: Imagining the tathāgatas in the ten directions, he should bow to them and mentally pay them homage.

source: །བཟླས་བརྗོད་ཀྱི་ཕྱག་རྒྱ་བཅིངས་ཏེ་བཟླས་བརྗོད་བགྱིའོ།
en: Forming the recitation mudrā, he should recite the mantra.

source: །བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་བགྱིས་པ་དངས་ཆེན་པོ་གཡོ་བར་འགྱུར་རོ། །བདག་ཉིད་དགའ་བར་གྱུར་ནས་འབར་བར་མཐོང་ངོ་།
en: After one hundred and eight repetitions the ground will shake violently, thrilling the vidyā holder, who will then perceive himself blazing with light.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཞལ་མངོན་སུམ་དུ་སྟོན་པ་ཉེ་བར་སྟོན་པར་འགྱུར་རོ།
en: All the tathāgatas will reveal their faces to him.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རལ་པའི་གསེབ་འབར་བར་གྱུར་ནས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara’s topknot will blaze with light from within, and the word ‘good!’ will resound. “

source: །ལན་བརྒྱ་རྩ་བརྒྱད་པ་ལན་གཉིས་བཟླས་བརྗོད་བགྱིས་ན། གྲུབ་པ་ཆེན་པོའི་རྟགས་སྟོན་པར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཕྱག་བརྐྱང་ནས་རིག་སྔགས་འཆང་གི་སྤྱི་བོར་འཇོག་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཟིགས་པ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ། །དོན་ཡོད་ཞགས་པ་གྲུབ་པའི་རིག་སྔགས་འཆང་བར་འགྱུར་རོ། །ཉི་མའི་རྩེ་ན་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་མཐོང་བར་གྱུར་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྟོན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་རོ། །བརྒྱ་རྩ་བརྒྱད་པ་ལན་གསུམ་བཟླས་ན་
en: After the vidyā holder completes the second round of one hundred and eight recitations, he will witness a sign of his profound accomplishment: Noble Avalokiteśvara will extend his hand and place it on the vidyā holder’s head.
